import Image from "next/image";
import React from "react";
import TopicsList from "./components/TopicsList";

const Home = () => {
  return (


     <>
        <TopicsList />
     </>
//     <div>
//       <div>
//         <div className="card glass shadow-2xl w-1/2 mx-auto">
//           <figure>
//             <Image
//               src="https://images.unsplash.com/photo-1484515991647-c5760fcecfc7?q=80&w=1498&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
//               alt="Image "
//               width={200}
//               height={200}
//               className="mx-auto rounded-full"
//             />
//           </figure>
//           <div className="card-body">
//             <h2 className="card-title">Life hack Shipon</h2>
//             <p>
//               একটি ছোট শহরে, রিয়া ও আরমান একে অপরকে খুব ভালোবাসত। তাদের
//               ভালোবাসা ছিল একদম নিখুঁত। প্রতিদিন সন্ধ্যায় তারা নদীর ধারে হাঁটত,
//               একে অপরের হাত ধরে স্বপ্নের মতো গল্প করত। কিন্তু একদিন, রিয়া অন্য
//               শহরে পড়াশোনার জন্য চলে গেল। আরমানের মন ভেঙে গিয়েছিল, কিন্তু সে
//               জানত তাদের ভালোবাসা শক্তিশালী। তারা প্রতিদিন চিঠি আদান-প্রদান করত,
//               আর তাতেই তাদের ভালোবাসা আরও গভীর হয়ে উঠল। বছর দুয়েক পরে, রিয়া
//               ফিরে এলো। সে আরমানকে বলল, আমি তোমার জন্য সব কিছু ছেড়ে এসেছি।
//               আরমান চোখের জল আটকে রাখতে পারল না। তারা আবার একসাথে নদীর ধারে
//               হাঁটতে শুরু করল, যেন কিছুই বদলায়নি। তাদের ভালোবাসা সময়ের সাথে
//               আরও মজবুত হলো, এবং একদিন তারা বিয়ে করল। তাদের জীবন হয়ে উঠল এক
//               সুন্দর গল্পের মতো, যেখানে ভালোবাসা সবসময়ই বিজয়ী হয়।
//             </p>
//             <div className="card-actions justify-end">
//               <button className="btn btn-primary">Learn now!</button>
//             </div>
//           </div>
//         </div>
//       </div>
//       <div>
//       <div className="card bg-base-100 w-96 shadow-xl mx-auto my-10">
//   <figure>
//     <Image
//       src="https://scontent.fcla1-1.fna.fbcdn.net/v/t39.30808-6/438128470_1202161227859759_7410691414528158788_n.jpg?stp=cp6_dst-jpg&_nc_cat=103&ccb=1-7&_nc_sid=f727a1&_nc_eui2=AeHBHOzh-5wMm55HfhAYiTmDF72ulAZ7q-gXva6UBnur6FNvL7UC3-Zd4a3H3s12qn09ifWhQXU_jLseXbQqK57e&_nc_ohc=9KLBTfLFf_AQ7kNvgGz86Q2&_nc_ht=scontent.fcla1-1.fna&oh=00_AYAUZKXCLF1nBOEy-bwMQcIy6RnVudB_ST-Cfi5U9_G-mw&oe=66E81B3F"
//       alt="Image"
//        width={100}
//        height={100}
//       className="mx-auto"
//     />
//   </figure>
//   <div className="card-body">
//     <h2 className="card-title">Life hack Shipon</h2>
//     <p>
//       ক্ষমা করে দিও অপ্রিয় হয়েও বার বার প্রিয় হওয়ার জন্য বিরক্ত করছি।😊❤️
//     </p>
//     <div className="card-actions justify-end">
//       <button className="btn btn-success">Learn now!</button>
//     </div>
//   </div>
// </div>

//       </div>
//     </div>
  );
};

export default Home;
